# ElementTypeDuplicatingEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementTypeDuplicatingEventArgs Class
Members See Also
---
The event arguments used by the ElementTypeDuplicating event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class ElementTypeDuplicatingEventArgs : RevitAPIPreDocEventArgs
```

Visual Basic
---
```text
Public Class ElementTypeDuplicatingEventArgs _
	Inherits RevitAPIPreDocEventArgs
```

Visual C++
---
```text
public ref class ElementTypeDuplicatingEventArgs : public RevitAPIPreDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreDocEventArgs Autodesk.Revit.DB.Events..::..ElementTypeDuplicatingEventArgs
# See Also
ElementTypeDuplicatingEventArgs Members
Autodesk.Revit.DB.Events Namespace